[
  {
    "recipe_name": "French toast",
    "visibility": true,
    "ingredients": "1 teaspoon ground cinnamon, 1/4 teaspoon ground nutmeg, 2 tablespoons sugar, 4 tablespoons butter, 4 eggs, 1/4 cup milk, 1/2 teaspoon vanilla extract, 8 slices challah, brioche, or white bread, 1/2 cup maple syrup, warmed. In a small bowl, combine cinnamon, nutmeg, and sugar and set aside briefly.",
    "directions": "In a 10-inch or 12-inch skillet, melt butter over medium heat. Whisk together cinnamon mixture, eggs, milk, and vanilla and pour into a shallow container such as a pie plate. Dip bread in egg mixture. Fry slices until golden brown, then flip to cook the other side. Serve with syrup.", 
    "description": "most delicious simple french toast",
    "user_id": 1,
    "category_id": 1,
    "url": "https://bestteamproj2.s3.amazonaws.com/d8c96b36e02fe429bade7f27a1afd3ce"
  },
  {
    "recipe_name": "Grilled Cheese",
    "visibility": true,
    "ingredients": "2 ounces sliced melting cheese (about 2 slices), such as American, Cheddar, muenster, Havarti, Swiss, fontina, Mozzarella, Monterey jack, pepper jack, provolone, 2 slices bread, such as white, rye, brioche, sourdough, potato, whole wheat, pumpernickel, 1 tablespoon fat, such as mayonnaise, butter or olive, chili or coconut oil.",
    "directions": "Oven method (great for a crowd of six or fewer): Put a rimmed baking sheet on the middle rack of the oven and preheat to 450 degrees F. Make one sandwich per person: Sandwich 2 slices of cheese between 2 slices of bread. Spread or brush the outside of the sandwich with 1 tablespoon of fat. Place on the preheated baking sheet and cook until the cheese starts to melt, about 5 minutes. Flip the sandwich and bake until golden brown, an additional 5 minutes.", 
    "description": "gooey grilled cheese",
    "user_id": 2,
    "category_id": 2,
    "url": "https://bestteamproj2.s3.amazonaws.com/d8c96b36e02fe429bade7f27a1afd3ce"
  },
  {
    "recipe_name": "Pizza",
    "visibility": false,
    "ingredients": "2 tablespoons sugar, 1 tablespoon kosher salt, 1 tablespoon pure olive oil, 1 tablespoon pure olive oil, 3/4 cup warm water, 2 cups bread flour (for bread machines), 1 teaspoon instant yeast, 2 teaspoons olive oil, Olive oil, for the pizza crust, Flour, for dusting the pizza peel. 1 1/2 ounces pizza sauce,  1/2 teaspoon each chopped fresh herbs such as thyme, oregano, red pepper flakes, A combination of 3 grated cheeses such as mozzarella, Monterey Jack, and provolone.",
    "directions": "Place the sugar, salt, olive oil, water, 1 cup of flour, yeast, and remaining cup of flour into a standing mixer's work bowl. Using the paddle attachment, start the mixer on low and mix until the dough just comes together, forming a ball. Lube the hook attachment with cooking spray. Attach the hook to the mixer and knead for 15 minutes on medium speed, Tear off a small piece of dough and flatten into a disc. Stretch the dough until thin. Hold it up to the light and look to see if the baker's windowpane, or taut membrane, has formed. If the dough tears before it forms, knead the dough for an additional 5 to 10 minutes. Roll the pizza dough into a smooth ball on the countertop. Place into a stainless steel or glass bowl. Add 2 teaspoons of olive oil to the bowl and toss to coat. Cover with plastic wrap and refrigerate for 18 to 24 hours.Place the pizza stone or tile onto the bottom of a cold oven and turn the oven to its highest temperature, about 500 degrees F. If the oven has coils on the oven floor, place the tile onto the lowest rack of the oven. Split the pizza dough into 2 equal parts using a knife or a dough scraper. Flatten into a disk onto the countertop and then fold the dough into a ball. Wet hands barely with water and rub them onto the countertop to dampen the surface. Roll the dough on the surface until it tightens. Cover one ball with a tea towel and rest for 30 minutes. Repeat the steps with the other piece of dough. If not baking the remaining pizza immediately, spray the inside of a ziptop bag with cooking spray and place the dough ball into the bag. Refrigerate for up to 6 days. Sprinkle the flour onto the peel and place the dough onto the peel. Using your hands, form a lip around the edges of the pizza. Stretch the dough into a round disc, rotating after each stretch. Toss the dough in the air if you dare. Shake the pizza on the peel to be sure that it will slide onto the pizza stone or tile. (Dress and bake the pizza immediately for a crisp crust or rest the dough for 30 minutes if you want a chewy texture.) Brush the rim of the pizza with olive oil. Spread the pizza sauce evenly onto the pizza. Sprinkle the herbs onto the pizza and top with the cheese. Slide the pizza onto the tile and bake for 7 minutes, or until bubbly and golden brown. Rest for 3 minutes before slicing.", 
    "description": "delicious pizza",
    "user_id": 3,
    "category_id": 3,
    "url": "https://bestteamproj2.s3.amazonaws.com/d8c96b36e02fe429bade7f27a1afd3ce"
  },
  {
    "recipe_name": "Apricot Glazed Chicken Breasts",
    "visibility": false,
    "ingredients": "3 tablespoons apricot preserves, 1 teaspoon fresh ginger paste, ½ teaspoon minced fresh rosemary, 2 (8 ounce) boneless, skinless chicken breasts, 1 teaspoon vegetable oil, salt and ground black pepper to taste.",
    "directions": "Stir apricot preserves, ginger paste, and rosemary together in a small bowl. Microwave for about 20 seconds to make preserves easier to spread. Pound chicken breasts to uniform thickness and pat dry with a paper towel. Rub with oil and season with salt and pepper. Preheat the air fryer to 400 degrees F (200 degrees C). Spray the basket with cooking spray and add chicken breasts in a single layer. Air fry for 4 minutes. Flip and rotate the position of the chicken breasts. Brush with the apricot mixture. Return basket to the air fryer and cook until chicken is no longer pink in the center and the juices run clear, 8 to 12 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Transfer chicken to a plate, cover loosely with aluminum foil, and let sit for 5 minutes. Cut chicken breasts into slices and serve.",
    "description": "exquisite chicken breast",
    "user_id": 4,
    "category_id": 4,
    "url": "https://images-gmi-pmc.edge-generalmills.com/5069d42a-d26f-4906-9eaf-7122a27d7900.jpg"
  },
  {
    "recipe_name": "Easy Meatloaf",
    "visibility": false,
    "ingredients": "1 ½ pounds ground beef, 1 egg, 1 onion, chopped, 1 cup milk, 1 cup dried bread crumbs, salt and pepper to taste, 2 tablespoons brown sugar, 2 tablespoons prepared mustard, ⅓ cup ketchup",
    "directions": "Preheat oven to 350 degrees F (175 degrees C). In a large bowl, combine the beef, egg, onion, milk and bread OR cracker crumbs. Season with salt and pepper to taste and place in a lightly greased 9x5-inch loaf pan, or form into a loaf and place in a lightly greased 9x13-inch baking dish. In a separate small bowl, combine the brown sugar, mustard and ketchup. Mix well and pour over the meatloaf. Bake at 350 degrees F (175 degrees C) for 1 hour.",
    "description": "excellent meatloaf",
    "user_id": 5,
    "category_id": 5,
    "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F06%2F19%2FEasy-Meatloaf.jpg&q=85"
  },
  {
    "recipe_name": "Classic and Simple Meat Lasagna",
    "visibility": false,
    "ingredients": "12 whole wheat lasagna noodles, 1 pound lean ground beef, 2 cloves garlic, chopped, ½ teaspoon garlic powder, 1 teaspoon dried oregano, or to taste, salt and ground black pepper to taste, 1 (16 ounce) package cottage cheese, 2 eggs, ½ cup shredded Parmesan cheese, 1 ½ (25 ounce) jars tomato-basil pasta sauce, 2 cups shredded mozzarella cheese",
    "directions": "Preheat oven to 350 degrees F (175 degrees C). Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, add the lasagna noodles a few at a time, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 10 minutes. Remove the noodles to a plate. Place the ground beef into a skillet over medium heat, add the garlic, garlic powder, oregano, salt, and black pepper to the skillet. Cook the meat, chopping it into small chunks as it cooks, until no longer pink, about 10 minutes. Drain excess grease. In a bowl, mix the cottage cheese, eggs, and Parmesan cheese until thoroughly combined. Place 4 noodles side by side into the bottom of a 9x13-inch baking pan; top with a layer of the tomato-basil sauce, a layer of ground beef mixture, and a layer of the cottage cheese mixture. Repeat layers twice more, ending with a layer of sauce; sprinkle top with the mozzarella cheese. Cover the dish with aluminum foil. Bake in the preheated oven until the casserole is bubbling and the cheese has melted, about 30 minutes. Remove foil and bake until cheese has begun to brown, about 10 more minutes. Allow to stand at least 10 minutes before serving.",
    "description": "easy classic lasagna",
    "user_id": 6,
    "category_id": 6,
    "url": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1896&h=948&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F994958.jpg"
  },
  {
    "recipe_name": "Bacon and Egg Tacos",
    "visibility": false,
    "ingredients": "6 eggs, ¼ cup crumbled cooked bacon, 2 tablespoons butter, 3 slices American cheese, diced, ¼ teaspoon salt, ¼ teaspoon ground black pepper, 6 flour tortillas, 1 cup salsa (Optional)",
    "directions": "Whisk eggs together in a bowl; stir in bacon. Melt butter in a skillet over medium heat. Add egg mixture; cook and stir until eggs are completely set, 2 to 3 minutes. Stir in American cheese, salt, and pepper. Wrap tortillas in damp paper towels; microwave until warmed through, 30 seconds to 1 minute. Spoon 1/4 cup egg mixture into the center of each tortilla; fold sides to cover. Serve with salsa.",
    "description": "simple tasty breakfast tacos",
    "user_id": 7,
    "category_id": 7,
    "url": "https://images.media-allrecipes.com/userphotos/4484963.jpg"
  },
  {
    "recipe_name": "Basic Italian Bean Soup",
    "visibility": false,
    "ingredients": "olive oil, 1 large onion, diced, 2 cloves garlic, or more to taste, 2 cups tomato sauce, 24 ounces prepared cannellini beans, 1 tablespoon dried basil, ½ teaspoon oregano, salt and ground black pepper to taste",
    "directions": "Heat olive oil in a pot over medium-high heat. Cook and stir onion in hot oil until tender, about 5 minutes; add garlic and continue cooking until fragrant, 1 to 2 minutes more. Pour tomato sauce into the pot; stir. Add cannelini beans, basil, oregano, salt, and pepper. Bring the mixture to a simmer, reduce heat to medium-low, and cook until the beans are hot, 5 to 7 minutes more.",
    "description": "delicious bean soup",
    "user_id": 8,
    "category_id": 8,
    "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1938306.jpg"
  }
]
