[
  {
    "recipe_name": "French toast",
    "visibility": true,
    "ingredients": "1 teaspoon ground cinnamon, 1/4 teaspoon ground nutmeg, 2 tablespoons sugar, 4 tablespoons butter, 4 eggs, 1/4 cup milk, 1/2 teaspoon vanilla extract, 8 slices challah, brioche, or white bread, 1/2 cup maple syrup, warmed. In a small bowl, combine cinnamon, nutmeg, and sugar and set aside briefly.",
    "directions": "In a 10-inch or 12-inch skillet, melt butter over medium heat. Whisk together cinnamon mixture, eggs, milk, and vanilla and pour into a shallow container such as a pie plate. Dip bread in egg mixture. Fry slices until golden brown, then flip to cook the other side. Serve with syrup.", 
    "description": "most delicious simple french toast",
    "user_id": 1,
    "category_id": 1
  },
  {
    "recipe_name": "Grilled Cheese",
    "visibility": true,
    "ingredients": "2 ounces sliced melting cheese (about 2 slices), such as American, Cheddar, muenster, Havarti, Swiss, fontina, Mozzarella, Monterey jack, pepper jack, provolone, 2 slices bread, such as white, rye, brioche, sourdough, potato, whole wheat, pumpernickel, 1 tablespoon fat, such as mayonnaise, butter or olive, chili or coconut oil.",
    "directions": "Oven method (great for a crowd of six or fewer): Put a rimmed baking sheet on the middle rack of the oven and preheat to 450 degrees F. Make one sandwich per person: Sandwich 2 slices of cheese between 2 slices of bread. Spread or brush the outside of the sandwich with 1 tablespoon of fat. Place on the preheated baking sheet and cook until the cheese starts to melt, about 5 minutes. Flip the sandwich and bake until golden brown, an additional 5 minutes.", 
    "description": "gooey grilled cheese",
    "user_id": 2,
    "category_id": 2
  },
  {
    "recipe_name": "Pizza",
    "visibility": false,
    "ingredients": "2 tablespoons sugar, 1 tablespoon kosher salt, 1 tablespoon pure olive oil, 1 tablespoon pure olive oil, 3/4 cup warm water, 2 cups bread flour (for bread machines), 1 teaspoon instant yeast, 2 teaspoons olive oil, Olive oil, for the pizza crust, Flour, for dusting the pizza peel. 1 1/2 ounces pizza sauce,  1/2 teaspoon each chopped fresh herbs such as thyme, oregano, red pepper flakes, A combination of 3 grated cheeses such as mozzarella, Monterey Jack, and provolone.",
    "directions": "Place the sugar, salt, olive oil, water, 1 cup of flour, yeast, and remaining cup of flour into a standing mixer's work bowl. Using the paddle attachment, start the mixer on low and mix until the dough just comes together, forming a ball. Lube the hook attachment with cooking spray. Attach the hook to the mixer and knead for 15 minutes on medium speed, Tear off a small piece of dough and flatten into a disc. Stretch the dough until thin. Hold it up to the light and look to see if the baker's windowpane, or taut membrane, has formed. If the dough tears before it forms, knead the dough for an additional 5 to 10 minutes. Roll the pizza dough into a smooth ball on the countertop. Place into a stainless steel or glass bowl. Add 2 teaspoons of olive oil to the bowl and toss to coat. Cover with plastic wrap and refrigerate for 18 to 24 hours.Place the pizza stone or tile onto the bottom of a cold oven and turn the oven to its highest temperature, about 500 degrees F. If the oven has coils on the oven floor, place the tile onto the lowest rack of the oven. Split the pizza dough into 2 equal parts using a knife or a dough scraper. Flatten into a disk onto the countertop and then fold the dough into a ball. Wet hands barely with water and rub them onto the countertop to dampen the surface. Roll the dough on the surface until it tightens. Cover one ball with a tea towel and rest for 30 minutes. Repeat the steps with the other piece of dough. If not baking the remaining pizza immediately, spray the inside of a ziptop bag with cooking spray and place the dough ball into the bag. Refrigerate for up to 6 days. Sprinkle the flour onto the peel and place the dough onto the peel. Using your hands, form a lip around the edges of the pizza. Stretch the dough into a round disc, rotating after each stretch. Toss the dough in the air if you dare. Shake the pizza on the peel to be sure that it will slide onto the pizza stone or tile. (Dress and bake the pizza immediately for a crisp crust or rest the dough for 30 minutes if you want a chewy texture.) Brush the rim of the pizza with olive oil. Spread the pizza sauce evenly onto the pizza. Sprinkle the herbs onto the pizza and top with the cheese. Slide the pizza onto the tile and bake for 7 minutes, or until bubbly and golden brown. Rest for 3 minutes before slicing.", 
    "description": "delicious pizza",
    "user_id": 3,
    "category_id": 3
  }
]
